package com.example.grammer;

import android.app.Activity;
import android.os.Bundle;
import android.widget.TextView;

public class ChangeThinking extends Activity {
	TextView textview;

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.changethinking);
		textview = (TextView) findViewById(R.id.textViewthinking);
		String str = "\n\n\t\t\t बात करते है सोच कि हमारे  दृष्टिकोण कि.……  किसी भी चीज़ को देखने का हमारा नजरिया या दृष्टिकोण ही हमारी सोच कहलाती है. और वास्तव में हम दो प्रकार से सोचते है, एक सकारात्मक और दूसरा नकारात्मक। सकारात्मक सोच  अर्थात हम कहते कि हमसे  हो पायेगा ,हम सफल हो पायेगे ,मेरा इंटरव्यू अच्छा जायेगा, मैं क्लास में टॉप करुगा इत्यादि , और अगर नकारात्मक सोच कि बात करे तो  वो हमें लगता है कि हमसे नहीं हो पायेगा, हम नहीं जा पायेगे,मैं  इंटरव्यू  पास नहीं कर पाउगा इत्यादि। \n\n\t\t\tचलो दूसरे तरीके से समझने कि कोशिश करता हु। शायद आपने ने कभी धयान दिया होगा इस घटना पर। क़ि एक ग्लास है, जिसमे आधा पानी दाल देते है. और पूछा जाता है बताईये क्या दिख  रहा है आपको? क़ोइ कहता है ‘आधा ग्लास भरा’  है कोई कहता है ‘आधा खाली’  है। और  कोई कहता है ‘आधा खली है आधा भरा है’.… और तो और कुछ महीनो पहले मोदी जी ने कहा ‘मुझे ग्लास  पूरा भरा हुआ दीखता है आधा पानी से व् और आधा हवा से। ज़ो जीने के लिए महत्वपूर्ण है’। … वस्तु  एक ही है लेकिन लोग अलग-२ तरीके से देखते है। … चूँकि  हमारी सोच अलग-२ है  \n\n\t\t\t इतिहास के पन्ने  उल्टा कर देखे तो हम पाते  है कि चंद लोगो कि ही विचार सकारात्मक है और ज्यादातर लोगो के विचार नकारात्मक है इसलिए दुनिया में कुछ ही लोग सफल हो पाये है, और अनके इंसान असफल |\n\n\t\t\tदोस्तों अगर ध्यान से देखे। .... हमारा दिमाग क्या है?   हम अपने दिमाग को जैसा चाहे वैसा programmed कर सकते है. सकारात्मक के लिए भी और नकारात्मक सोच के लिए भी. दिमाग केवल और केवल परिणाम देता है. किस प्रकार का परिणाम होगा ये हम पर निर्भर करता है,जैसे एक  गमला ले लीजिये , गमले में जिस प्रकार का भी बीज  हम डालते  है  ,उसी प्रकार का  पौधा तैयार होता है . गमले का काम केवल और केवल पौधा तैयार करना है अब वो  एक अच्छे फूल का पौधा हो या कटीली झाडीओ का.…   यह निर्भर करता है कि बीज  किस प्रकार का डाला जा रहा है   है. तो बीज लगाना  गमले के हाथ में नहीं है गमला चुनाव नहीं करेगा बीज का। ……।  ,बीज  का चुनाव हम करते है, गमले का काम है, केवल और केवल निस्कर्ष निकलना, पौधा उगाना।\n\n\t\t\tया अगर मै कहू   हमारा  दिमाग एक servant कि तरह होता है जिस प्रकार servant  को आदेश कि जरुरत होती है और आदेश के अनुसार वो कार्य करता है जैसे servant  को कहा जाये कि एक  गिलास पानी ले कर आओ तो वो पानी ले कर आएगा दूध नहीं, नौकर का काम है केवल और केवल आदेश का पालन करना और निस्कर्ष देना same  उसी तरह से हमारा दिमाग हैं | \n\t\t\tहम जैसे चाहे वैसे अपने दिमाग को programmed  कर सकते है चाहे वो सकारात्मक सोच हो या नकारात्मक सोच हो. ये हम पर निर्भर करता है | लेकिन फिर से कहुगा कि हम ज्यादातर नकारात्मक  सोच से ग्रसित है |\n\n\t\t\t  अब सवाल उठता है कि इसे दूर कैसे करे.…  दूर करने से पहले मैं इनके लक्षण आपको बताना चाहुगा। इसके दो प्रमुख लक्षण है पहला है ’आलसपन’  अगर आप कभी भी आलस कर रहे है तो मतलब समझ लीजिये कि आप नाकारात्मक सोच से ग्रसित है. \n\n\t\t\t और दूसरा अगर आप ’excuse’ दे रहे है, किसी भी जगह  आप लेट पहुँचने के लिए या हार जाने  के  लिए अच्छा परिणाम ना लाने  के लिए अगर आप excuse  दे रहे है,  तो आप मान के चलिए कि आप कि सोच नकारात्मक है. तो ये दोनों चीज़े आप बंद करे |\n\n\t\t\tअब सवाल उठता है,  कि हम सोच सकारात्म कैसे करे तो कुछ खास मैं आपको तरीके बताता हु, पहला है कि आप अपनी dictionary से ‘नही’ शब्द को हटा दे और उसमे लिख दे  ’कोशिश’ कोई भी एक अच्छा काम जो आप कर  सकते है,और करना चाहिए, उसके लिए आप ना  ना बोले कोशिश बोले और जब कोशिश कि संख्य़ा  बढ   जाये तो एक दिन कोशिश को मिटा के ’जरुर’ डाले ये काम मेरे से जरुर हो पायेगा और मैं जरुर कर पाउगा |";
		textview.setText(str);
         
	}
}
