package com.example.grammer;

import android.app.Activity;
import android.os.Bundle;
import android.widget.TextView;

public class EnglishBugaboo extends Activity {
	TextView textview;

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.englisgbugaboo);
		textview = (TextView) findViewById(R.id.textViewenglisgbugaboo);
		String str="\n\n\nनमस्कार दोस्तों,\nदोस्तों आज मै  खास बाते share करना चाहता हू। ……  , English भाषा कैसे सीखे,,,,,,, ,अगर मै किसी  beginner  कि बात करू.…।  क्या होता है उनके साथ ?  ,उन्हें English एक हउवा की तरह लगता है, घबराहट होती है ,’हे भगवान् कैसे बोलू ,क्या होगा मेरा ’……।   जब भी हम English में कुछ बोलने की कोशिश करते है तो हमारे मन में ये डर बैठा हुआ होता है, कही हमसे कोई गलती तो नहीं हो जाएगी, सामने वाला क्या सोचेगा, वो हँस  तो नहीं देगा ,वैगैरा-वैगैरा। शायद  आप मेरी इस बात से इतेफाक रखेगे|\n\t\t\tदोस्तों मै दावे के साथ कहना चाहता हू ,लोग आपके ऊपर जरुर हँसेंगे  और आपका मजाक भी  उड़ायेंगे। …तो  मेरा यही गुरु मंत्र  है। । इसके लिए  आप इसके  तैयार रहे, वो जरुर हँसेंगे, थोडा बेशरम बन जाये , कोई हर्ज नहीं दोस्तों। ।  , ये मनुष्य जाती की प्रवृती है की वो किसी का  अच्छा नहीं देख सकते ,दुसरो पर कीचड़ उछालना ये तो आप फितरत है ।अरे लोगो ने तो भगवान को नहीं छोड़ा ,तो फिर हम कहा और आप कहा  …….  \n\n\t\t\tआप मन में ठान ले, मुझे तो बोलना है ,जो भी मन में आये बिंदास बोले ,चाहे वो गलत ही क्यों ना हो , जब तक आप गलती नहीं करेगे तो सीखेगे कैसे।असफलता से न डरे। । एक सफल वयक्ति से एक असफल इंसान ने पूछा ‘आप सफल कैसे है और हम असफल क्यों  ?’ तो सफल व्यक्ति ने उत्तर दिया ‘मै सफल इसलिए हू,  क्योकि मै आपसे ज्यादा  बार असफल हुआ था ‘क्या गजब उत्तर है दोस्तों     एक  बच्चा जब चलना सीखता है तो बहुत  गलतिया  करता है लडखडाता , कभी गिरता है कभी संभलता है , लेकिन वो सीखना नहीं छोड़ता ….  और एक दिन ऐसा भी आता है जब वो सरपट भागने लगता है  |तो दोस्तों आप दुसरो का न सोचे। … आप कोशिश  करते रहे,जो होगा देखा जायेगा। …. भाड़  में जाये दुनिया ….आग लगे बस्ती में ,मस्त राम मस्ती में। … \n\t\t\tमै आप लोगो को एक घटना के बारे में बताना चाहता हु, बात उस समय की है जब मै कोचिंग नहीं चलाता था ,खाना खाने के बाद अक्सर मै अपने दोस्त आनंद के साथ टहला करता था, और हम English में practice किया करते थे , एक दिन सामने से दो लड़कियां आ रही थी हमने ध्यान नहीं दिया हमारा English में conversation चल रहा था ,जैसे ही वो बगल से गुजरी तो उन्होंने एक comment मारा ‘ये देखो अंग्रेज के औलाद English झाड़ रहे है  'मेरे दोस्त ने तुरंत reply दिया क्या आप को English आती है तो उन्होंने कहा ‘जी नहीं’ फिर दोस्त ने कहा ‘Then mind your own  language’ . उसके बाद वो लोग sorry  बोल कर चले गए। \n\t\t\tवास्तव में मजाक वो लोग उड़ाते है जिन्हें English नहीं आती है।जो व्यक्ति English का जानकर हो वो हमेशा आपको encourage करेगा, वो आपको support करेगा। …। अच्छा एक बात और बता दू हमें कभी -कभी यह भी लगता है वो तो English का जानकर है उनसे मै कैसे बात करू ?कही गलती न हो जाये फिर से कहूँगा ,,,, वह बिलकुल भी मजाक नहीं उडाएगा। आप कोशिश जरुर करे  अच्छा अब दूसरी बात , आपके दिमाग में एक सवाल आ रहा होगा, ठीक है हम प्रैक्टिस करेगे। चाहे  गलत -सलत ही क्यों न हो ।लेकिन कही हम हम गलत English तो नहीं सिख जायेगे।जी नहीं, बिलकुल भी ऐसा नहीं होगा,एक दिन ऐसा भी आएगा जब आपको  खुद ब खुद पता चल जायेगा की गलती कहा कर रहा हू।.। आपको  अजीब लगेगे, जैसे हिंदी में एक वाक्य बोलू ‘  मोहन स्कूल जाती है ‘। कैसा लगा पढ़ने  के बाद। …. एकदम अजीब लगा। जी हा English  में भी आपके साथ ऐसा ही होगा। … \n\n\t\t\tLet me tell you....Water cuts the rock..not because of power , but because of steady...... \n\n\t वो कहते है न हिंदी  में एक कहावत है। \n\t’ करत- करत  अभ्यास के जड़मति होत सुजान\n\t रसरी आवत -जावत सील पर होत  निसान ‘";
		textview.setText(str);
         
	}
}
