package com.example.grammer;

import android.app.Activity;
import android.os.Bundle;
import android.widget.TextView;

public class EnglishTecknik extends Activity {
	TextView textview;

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.englishteknik);
		textview = (TextView) findViewById(R.id.textViewenglishteknikk);
		String str="\n\n क्या हमने कभी जानने कि कोशिश कि हम English क्यों नहीं सिख पाये?जबकि एक हिंदी माध्यम student class  6th  से लेकर class  12th  तक अपने स्कूल में English  सिखता है. 7 साल grammar  पढ़ने के बावजूद भी हम केवल 1 line  ही सिख पाते  है ’May I  come sir ?’ आखिर ऐसा क्यों होता है? कि हम केवल एक या दो   essay या application रट  पाते  है क्या कारण  हो सकता है ?क्या हम इंग्लिश में कमजोर है या हम पढाई में poor  है जी  नहीं यदि ऐसा होता तो हम बाकि विषयो में अच्छे अंक न ला पाते. \n \t\t\t\t  हो सकता है हमारे teachers   जो हमे सिखा रहे है वे कमजोर हो, जी नहीं ऐसा भी बिलकुल नही है, तो शायद अंग्रेजी भाषा ही कठिन हो. ऐसा तो बिलकुल भी नहीं है। आज पूरी दुनिया में हर एक कोने में बड़ी आसानी से इंग्लिश बोली जा रही है तो समस्या कँहा  है? \n \t\t\t\t  समस्या है पढ़ाने  के तकनीक में. Science कहता है कि एक छोटा बच्चा भी बड़े से बड़े पत्थर को हिला सकता है बशर्ते तकनीक सही हो, और अगर तकनीक गलत है, तो एक पहलवान भी सुई नहीं उठा सकता। \n \t\t\t\tवास्तव में किसी भी कठिन कार्य को करने के लिए सही तकनीक का होना जरुरी है फिर वाही कार्य आसान लगने लगता है. अब आप सोच रहे होगे कि यह सही तकनीक है क्या इसे एक प्रश्न के माध्यम से समझाया जा सकता है निचे हम आपको कुछ शब्द दे रहे है उनका आप अर्थ लिखे \nतोडना \n अंगूर \n उधार  लेना \n समझाना \n खोदना \n पीटना \n \n अब हम आपको कुछ English  के शब्द दे रहे है उनके हिंदी में अर्थ लिखे \n \n grape\n describe\n break\n borrow\n beat\n dig\n\nयह एक मजेदार घटना है, शायद  आपको कुछ बाते स्पष्ट हो पाया होगा कि आप हिंदी शब्दो का इंग्लिश में अर्थ नहीं बता पाये होगे,लेकिन इंग्लिश शब्दो का आसानी से हिंदी में अर्थ बता दिया होगा और English  में दिए गए  शब्द ,ऊपर में दिए गए  हिंदी के शब्दो के ही अर्थ है। . लेकिन हम फिर भी  नहीं बता पाये . \n\t\t\t\t इसके पीछे  कारण यह है जब हम स्कूल में थे तो हमे इंग्लिश के शब्दो का हिंदी में अर्थ रटाया गया था, न कि किसी हिंदी शब्द को इंग्लिश में क्या कहा जाता है. \n\t\t\t\t  जब हम किसी से इंग्लिश में बात करने कि कोशिश करते है, तो हमे इंग्लिश के शब्द परेशान  नहीं करते बल्कि हिंदी के शब्द परेशान करते है, और हम बात करते समय अटक जाते है और यह सोच में पड़ जाते है कि  तोडना को क्या कहते, है या उधार  देना को क्या कहते है. और उस समय तोडना के लिए break शब्द याद नहीं आता क्योंकि हमने break के लिए तोडना याद किया है। ना कि तोड़ने के लिए break  याद किया है|\n\t\t\t\t   उसी तरह से हमारा grammar  पढ़ने या पढ़ाने  का तरीका गलत है हमे स्कूल में पढ़ाया जाता है कि present indefinite का प्रयोग फलां  स्थान पर can  का प्रयोग फलां  स्थान पर और should  का प्रयोग किसी खास स्थान पर जो कि एक गलत तरीका है जबकि सही तरीका इसके विपरीत है जब हम फलां अवस्था में हो तो  present  indefinite का प्रयोग करे फलां  फलां  में हो तो can  आदि वास्तव में व्यक्ति किसी भाषा को इसलिए सीखता है ताकि अपनी भावनाओ को अछे से व्यक्त कर पाये या हम कहे कि व्यक्ति जिन अवस्थाओ में होता है उसके अनुसार शब्दो का वाक्यो का ग्रामर का चुनाव करता है अतः  हमे इस बात पर जोर देना चाहिए कि  हम अपनी अवस्था के अनुसार  अपने भावनाओ को English  में किस तरह से व्यक्त करें मान लीजिये कोई आपको challenge  करे तो उस अवस्था में अपनी भावनाओ को can से व्यक्त करे उसी तरह किसी कार्य को नहीं कर पाते  क्योंकि हम मजबूर है या जैसे हम कहे आपका कोई दोस्त आपको कहता है चलो पिक्चर चले लेकिन आप नहीं जा पाते क्योंकि किसी कार्य को आप मजबूरन कर रहे हो तब उस अवस्था में अपने मज़बूरन किये जाने वाले कार्य को have  to  या has  to  से दर्शा सकते  है |";
		textview.setText(str);
         
	}
}
