package com.example.grammer;

import android.app.Activity;
import android.os.Bundle;
import android.widget.TextView;

public class GlassJar extends Activity {
	TextView textview;

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.glassjar);
		textview = (TextView) findViewById(R.id.textViewglassjar);
		String str="\n\n\t\t\t\t जीवन में जब सब कुछ एक साथ और जल्दी – जल्दी करने की इच्छा होती है , सब कुछ तेजी से पा लेने की इच्छाहोती है , और हमें लगने लगता है कि दिन के चौबीस घंटे भी कम पड़ते हैं , उस समय ये बोध कथा ,\n’ काँच की जार और दो कप चाय ’ हमें याद आती है ।\n\nदर्शनशास्त्र के एक प्रोफ़ेसर कक्षा में आये और उन्होंने छात्रों से कहा कि वे आज जीवन का एक महत्वपूर्ण पाठ पढानेवाले हैं …\nउन्होंने अपने साथ लाई एक काँच की बडी़ बरनी ( जार ) टेबल पर रखा और उसमें टेबल टेनिस की गेंदें डालने लगे औरतब तक डालते रहे जब तक कि उसमें एक भी गेंद समाने की जगह नहीं बची … \n\nउन्होंने छात्रों से पूछा \n क्या बरनी पूरीभर गई ?  हाँ …  आवाज आई …  फ़िर    प्रोफ़ेसर साहब ने छोटे –\n छोटे कंकर उसमें भरने शुरु किये  धीरे –\n धीरे जार को हिलाया तो काफ़ी सारे कंकर उसमें जहाँ जगह खाली थी , समा गये , फ़िर से प्रोफ़ेसर साहब ने पूछा , क्या अब\nजार भर गई है ,  छात्रों ने एक बार फ़िर हाँ … कहा  अब प्रोफ़ेसर साहब ने रेत की थैली से हौले \n हौले उस जार   में रेत  डालना शुरु किया , वह रेत भी उस जार में जहाँ संभव था बैठ गई ,  अब छात्र अपनी नादानी पर हँसे … फ़िर प्रोफ़ेसरसाहब ने पूछा , क्यों अब तो यह जार  पूरी भर गई ना ? हाँ .. अब तो पूरी भर गई है ..   सभी ने एक स्वर में कहा .. सरने टेबल के नीचे से चाय के दो कप निकालकर उसमें की चाय जार में डाली , चाय भी रेत के बीच स्थित थोडी़ सी जगहमें सोख ली गई …\nप्रोफ़ेसर साहब नेगंभीरआवाज में  समझाना  शुरु किया \nइस काँच की जार  को तुम लोग अपना जीवन समझो …\nटेबल टेनिस की गेंदें सबसे महत्वपूर्ण भाग अर्थात भगवान , परिवार , बच्चे , मित्र , स्वास्थ्य और  शौक हैं ,\nछोटे कंकर मतलब तुम्हारी नौकरी , कार , बडा़ मकान आदि हैं , और\nरेत का मतलब और भी छोटी  छोटी बेकार सी बातें , मनमुटाव , झगडे़ है ..\n\nअब यदि तुमने काँच की जार  में सबसे पहले रेत भरी होती तो टेबल टेनिस की गेंदों और कंकरों के लिये जगह ही नहीं बचती , या कंकर भर दिये होते तो गेंदें नहीं भर पाते , रेत जरूर आ सकती थी … ठीक यही बात जीवन पर लागू होती है … यदि तुम छोटी \n छोटी बातों के पीछे पडे़ रहोगे और अपनी ऊर्जा उसमें नष्टकरोगे तो तुम्हारे पास मुख्य बातों के लिये अधिक समय नहीं रहेगा … मन के सुख के लिये क्या जरूरी है ये तुम्हें तयकरना है ।\n अपने बच्चों के साथ खेलो , बगीचे में पानी डालो , सुबह पत्नी के साथ घूमने निकल जाओ , घर के बेकार सामान को बाहर निकाल फ़ेंको , मेडिकल चेक –\n अप करवाओ … टेबल टेनिस गेंदों की फ़िक्र पहले करो , वही  महत्वपूर्ण है ….. पहले तय करो कि क्या जरूरी है … बाकी सब तो रेत है ..\nछात्र बडे़ ध्यान से सुन रहे थे .. अचानक एक ने पूछा , सर लेकिन आपने यह नहीं बताया कि ’ चाय के दो कप ’ क्या हैं? प्रोफ़ेसर मुस्कुराये , बोले .. मैं सोच ही रहा था कि अभी तक ये सवाल किसी ने क्यों नहीं किया …\nइसका उत्तर यह है कि , जीवन हमें कितना ही परिपूर्ण और संतुष्ट लगे , लेकिन अपने खास मित्र के साथ दो कप चाय पीने की जगह हमेशा होनी चाहिये ।";
		textview.setText(str);
         
	}
}
