package com.example.grammer;

import android.app.Activity;
import android.os.Bundle;
import android.widget.TextView;

public class SelfIntrospection extends Activity {
	TextView textview;

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.selfintrospection);
		textview = (TextView) findViewById(R.id.textViewselfintrospection);
		String str="\n\nएक छोटा बच्चा एक बड़ी दुकान पर लगे टेलीफोन बूथ पर जाता हैंऔर मालिक से छुट्टे पैसे लेकर एक नंबर डायल करता हैं।\n दुकान का मालिक उस लड़के को ध्यान से देखते हुए उसकी बातचीत पर ध्यान देता हैं -\nलड़का - मैडम क्या आप मुझे अपने बगीचे  \n की साफ़ सफाई का काम देंगी? \nऔरत - (दूसरी तरफ से) नहीं, मैंने एक दुसरे\n लड़के को अपने बगीचे का काम\n देखने के लिए रख लिया हैं।\nलड़का - मैडम मैं आपके बगीचे का काम उस\n लड़के से आधे वेतन में करने को तैयार हूँ! \nऔरत  - मगर जो लड़का मेरे बगीचे का \n काम कर रहा हैं उससे मैं पूरी तरह\n संतुष्ट हूँ।\nलड़का - ( और ज्यादा विनती करते हुए) \n  मैडम मैं आपके घर की सफाई भी\n फ्री में कर दिया करूँगा!! \nऔरत -  माफ़ करना मुझे फिर भी जरुरत नहीं हैं।धन्यवाद।\n\nलड़के के चेहरे पर एक मुस्कान उभरी और उसने फोन का रिसीवर रख दिया।\nदुकान का मालिक जो छोटे लड़के की बात बहुत ध्यान से सुन रहा था वह लड़के के पास आया और बोला- ' बेटा मैं तुम्हारी लगन और व्यवहार से बहुत खुश हूँ,मैं तुम्हे अपने स्टोर में नौकरी दे सकता हूँ'।\nलड़का - नहीं सर मुझे जॉब की जरुरत नहीं हैं\nआपका धन्यवाद।\nदुकानमालिक- (आश्चर्य से) अरे अभी तो तुम\n उस लेडी से जॉब के लिए\n इतनी विनती कर रहे थे !! \nलड़का - नहीं सर, मैं अपना काम ठीक\n से कर रहा हूँ की नहीं बस मैं ये चेक कर रहा था, \nमैं जिससे बात कर रहा था, उन्ही के यहाँ पर जॉब करता हूँ।\n\n‘This is called Self Appraisal’आप अपना बेहतर दीजिये, फिर देखिये सारी दुनिया आपकी प्रशंसा करेगी...";
		textview.setText(str);
         
	}
}
