package com.example.grammer;

import android.app.Activity;
import android.os.Bundle;
import android.widget.TextView;

public class ValueOf500 extends Activity {
	TextView textview;

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.valueof500);
		textview = (TextView) findViewById(R.id.textViewvalueof500);
		String str="\n\n एक जाने-माने स्पीकर ने हाथ में पांच सौ का नोट लहराते हुए अपनी सेमीनार शुरू की। हाल में बैठे सैकड़ों लोगों से उसने पूछा, ‘ये पांच सौ का नोट कौन लेना चाहता है?’ \n हाथ उठना शुरू हो गए।फिर\n उसने कहा, ‘मैं इस नोट को आपमें से किसी एक को दूंगा पर उससे पहले मुझे ये कर लेने दीजिय।’और उसने नोट  को अपनी मुट्ठी में निचोड़ना  शुरू कर दिया और फिर उसने पूछा, ‘कौन है जो अब भी यह नोट लेना  चाहता है?’ अभी भी लोगों के हाथ उठने शुरू हो गए।’अच्छा’ उसने कहा,’अगर मैं ये कर दूं?’ और उसने नोट  को नीचे गिराकर पैरों से कुचलना शुरू कर दिया। उसने नोट उठाई, वह बिल्कुल चिमुड़ी और गन्दी हो गयी  थी।’क्या अभी भी कोई है जो इसे लेना चाहता है?’और एक  बार  फिर हाथ उठने शुरू हो गए।\n\t\t ’दोस्तों, आप लोगों ने आज एक बहुत महत्त्वपूर्ण पाठ सीखा है। मैंने इस नोट के साथ इतना कुछ किया  पर फिर भी आप इसे लेना चाहते थे ,क्योंकि ये सब होने के बावजूद नोट की कीमत घटी नहीं, उसका मूल्य अभी भी 500 था। \n \t\tजीवन में कई बार हम गिरते हैं, हारते हैं, हमारे लिए हुए निर्णय हमें मिटटी में मिला देते हैं। हमें ऐसा लगने लगता है कि हमारी कोई कीमत नहीं है। लेकिन आपके साथ चाहे जो हुआ हो या  भविष्य में जो हो जाए, आपका मूल्य कम नहीं होता। आप स्पेशल हैं, इस बात को कभी मत भूलिए। कभी भी बीते हुए कल की निराशा को आने वाले कल के सपनों को बर्बाद मत करने दीजिये। याद रखिये आपके पास जो  सबसे कीमती चीज है, वो है आपका जीवन...भगवान्  ने हमें जिंदगी एक ही बार दी है। इसे बेकार न जाने दे। …\n। सोचे मत, उठे और आज ही अपने जीवन को महान बनाने के लिए एक कारण दे… मेरी शुभ कामनाये। …  ";
		textview.setText(str);
		
         
	}
}
